************************* How to create new columns derived from existing columns*************************

In [2]:
print('create a new column to the existing dataframe ')
print('create a dictionary')
import pandas as pd
data2={
    'Name':['Pandas','Loc','Lio','Geeks'],
    'Height':[22,12,23,11],
    'Qualification':['Mba','Ca',"data A",'Doc']
}
print('convert dictionary into dataframe')
df=pd.DataFrame(data2)
df

create a new column to the existing dataframe
create a dictionary
convert dictionary into dataframe

     Name  Height Qualification
0  Pandas      22           Mba
1     Loc      12            Ca
2     Lio      23        data A
3   Geeks      11           Doc

In [5]:
print('create a list and convert into column in existing dataframe')
address=['new york','america','india','germany']
print('use this column in existing dataframe')
print('use this column')
df['address']=address
display(df)

create a list and convert into column in existing dataframe
use this column in existing dataframe
use this column

     Name  Height Qualification   address
0  Pandas      22           Mba  new york
1     Loc      12            Ca   america
2     Lio      23        data A     india
3   Geeks      11           Doc   germany

In [ ]:
print('create dataframe and use indexing')
import pandas as pd
data= {
    "Stuname":["Amit","Sumit","Radha"],
    "stumarks":[50,30,60],
    "rollno":[100,99,200]
}
df=pd.DataFrame(data,index=["stu1","stu2","stu3"])
print(df)
sort1=df.sort_values(by=["stumarks","rollno"])
#sort1=df.sort_values(by="rollno")
sort1

     Stuname  stumarks  rollno
stu1    Amit        50     100
stu2   Sumit        30      99
stu3   Radha        60     200

     Stuname  stumarks  rollno
stu2   Sumit        30      99
stu1    Amit        50     100
stu3   Radha        60     200

In [ ]:
print('create a new column to the existing column in dataframe ')
print('create a dictionary')
import pandas as pd
data3={
    'Name':['Pandas','Loc','Lio','Geeks'],
    'Height':[22,12,23,11],
    'Qualification':['Mba','Ca',"data A",'Doc'],
    'price':[200,300,400,500]
}
print('convert dictionary into dataframe')
print('before adding new column')
df=pd.DataFrame(data3)
display(df)
print('\n')

print('create a new column in existing dataframe')
df['price change']=df['price']*40
df

create a new column to the existing dataframe
create a dictionary
convert dictionary into dataframe
before adding new column

     Name  Height Qualification  price
0  Pandas      22           Mba    200
1     Loc      12            Ca    300
2     Lio      23        data A    400
3   Geeks      11           Doc    500

create a new column in existing dataframe

     Name  Height Qualification  price  price change
0  Pandas      22           Mba    200          8000
1     Loc      12            Ca    300         12000
2     Lio      23        data A    400         16000
3   Geeks      11           Doc    500         20000

DataFrame.insert()
There is a built-in method called insert() to add a new column. 
steps
1. Create DataFrame using dictionary.
2. Create a list containing new column data. Make sure that the length of the list matches the length of the data which is already present in the data frame.
3. Insert the data into the DataFrame using DataFrame.insert(index, column_name, data) method.

In [28]:
#import pandas
import pandas as pd
# craete dataframe
data4={
    'Name': ['Hafeez', 'Aslan', 'Kareem'],
   'Age': [19, 18, 15],
   'Profession': ['Pythoneer', 'Programmer', 'Student']    
}

dataframe=pd.DataFrame(data4)
print('*****************before add new column***************')
print(dataframe)
print('\n')
print('craete a new list')
address=['jalandhar','amritsar','pune']
# now use address column in existing dataframe gives the index number where we want to insert
dataframe.insert(2,'person address',address)
print('********************************after add new column************')
print(dataframe)

*****************before add new column***************
     Name  Age  Profession
0  Hafeez   19   Pythoneer
1   Aslan   18  Programmer
2  Kareem   15     Student


craete a new list
********************************after add new column************
     Name  Age person address  Profession
0  Hafeez   19      jalandhar   Pythoneer
1   Aslan   18       amritsar  Programmer
2  Kareem   15           pune     Student

DataFrame.assign()
This method takes one argument i.e., a list of data and adds it to the data frame as a column at the end.

steps
1. Create DataFrame using a dictionary.
2. Create a list containing new column data. Make sure that the length of the list matches the length of the data which is already present in the data frame.
3. Insert the data into the DataFrame using DataFrame.assign(column_name = data)
method. It returns a new data frame. So, we have to store it.
4. Print the new data frame.

In [ ]:
#import pandas
import pandas as pd
# craete dataframe
data4={
    'Name': ['Hafeez', 'Aslan', 'Kareem','sunita'],
   'Age': [19, 18, 15,32],
   'Profession': ['Pythoneer', 'Programmer', 'Student','wife']    
}

dataframe=pd.DataFrame(data4)
print('*****************before add new column***************')
print(dataframe)
print('\n')
print('craete a new list')
address=['jalandhar','amritsar','pune','pape']
# now use assigning address column in existing dataframe
new_dataframe=dataframe.assign(PeopleAddress=address)
print('********************************after add new column************')
print(new_dataframe)

*****************before add new column***************
     Name  Age  Profession
0  Hafeez   19   Pythoneer
1   Aslan   18  Programmer
2  Kareem   15     Student
3  sunita   32        wife


craete a new list
********************************after add new column************
     Name  Age  Profession peopleAddress
0  Hafeez   19   Pythoneer     jalandhar
1   Aslan   18  Programmer      amritsar
2  Kareem   15     Student          pune
3  sunita   32        wife          pape